zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
/***************************************************************************//**
* \file cy_capsense_generator_lp.c
* \version 10.0.0
*
* \brief
* This file contains the source of functions common for register map
* generator module.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <string.h>
#include "cycfg_capsense_defines.h"
#include "cycfg_peripherals.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing_lp.h"
#include "cy_capsense_generator_lp.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_msclp.h"
#endif

#if (defined(CY_IP_M0S8MSCV3LP))

/*******************************************************************************
* Internal function prototypes
*******************************************************************************/
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_ENABLED)
    static void Cy_CapSense_GenerateMultiphaseSensorConfig(
                uint32_t snsFrameType,
                uint32_t scanSlotIndex,
                uint32_t * ptrSensorCfgLoc,
                cy_stc_capsense_context_t * context);
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateBaseConfig
****************************************************************************//**
*
* Generates the configuration for all registers that have to be configured
* one-time to initialize the MSCLP block.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateBaseConfig(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus;

    cy_stc_capsense_internal_context_t * ptrIntrCxt = context->ptrInternalContext;
    const cy_stc_msclp_base_config_t cy_capsense_smTemplate = CY_CAPSENSE_SENSING_METHOD_BASE_TEMPLATE;
    cy_stc_msclp_base_config_t * ptrBaseCfg = context->ptrBaseFrameContext;
    const cy_stc_msclp_base_config_t * ptrTemplateCfg = &cy_capsense_smTemplate;

    /*
     * BASE CONFIGURATION
     */

    /* Copy template of a base config */
    ptrBaseCfg->ctl = ptrTemplateCfg->ctl;
    ptrBaseCfg->scanCtl1 = ptrTemplateCfg->scanCtl1;
    ptrBaseCfg->scanCtl2 = ptrTemplateCfg->scanCtl2;
    ptrBaseCfg->initCtl1 = ptrTemplateCfg->initCtl1;
    ptrBaseCfg->initCtl2 = ptrTemplateCfg->initCtl2;
    ptrBaseCfg->initCtl3 = ptrTemplateCfg->initCtl3;
    ptrBaseCfg->initCtl4 = ptrTemplateCfg->initCtl4;
    ptrBaseCfg->senseDutyCtl = ptrTemplateCfg->senseDutyCtl;
    ptrBaseCfg->ccompCdacCtl = ptrTemplateCfg->ccompCdacCtl;
    ptrBaseCfg->mscCmpCtl = ptrTemplateCfg->mscCmpCtl;

    ptrBaseCfg->aosCtl = ptrTemplateCfg->aosCtl;
    ptrBaseCfg->ceCtl = ptrTemplateCfg->ceCtl;
    ptrBaseCfg->pumpCtl = ptrTemplateCfg->pumpCtl;

    ptrBaseCfg->intr = ptrTemplateCfg->intr;
    ptrBaseCfg->intrSet = ptrTemplateCfg->intrSet;
    ptrBaseCfg->intrMask = ptrTemplateCfg->intrMask;
    ptrBaseCfg->intrLp = ptrTemplateCfg->intrLp;
    ptrBaseCfg->intrLpSet = ptrTemplateCfg->intrLpSet;
    ptrBaseCfg->intrLpMask = ptrTemplateCfg->intrLpMask;
    ptrBaseCfg->swSelCdacRe = ptrTemplateCfg->swSelCdacRe;
    ptrBaseCfg->swSelCdacCo = ptrTemplateCfg->swSelCdacCo;
    ptrBaseCfg->swSelCdacCf = ptrTemplateCfg->swSelCdacCf;
    ptrBaseCfg->swSelBgr = ptrTemplateCfg->swSelBgr;

    /*
     * CONFIGURATION FROM CAPSENSE&trade; DATA STRUCTURE
     */

    ptrBaseCfg->ctl &= ~MSCLP_CTL_EXT_FRAME_START_MODE_Msk;

    /* Set the current scanning mode */
    CY_REG32_CLR_SET(ptrBaseCfg->ctl, MSCLP_CTL_OPERATING_MODE, ptrIntrCxt->operatingMode);
    /* Generating the common configuration for the number of the auto-resampling cycles and the counter behaviour when the
     * RAW_COUNT exceeds 0xFFFF
     */
    CY_REG32_CLR_SET(ptrBaseCfg->scanCtl1, MSCLP_SCAN_CTL1_NUM_AUTO_RESAMPLE, context->ptrCommonConfig->numBadScans);
    CY_REG32_CLR_SET(ptrBaseCfg->scanCtl1, MSCLP_SCAN_CTL1_RAW_COUNT_MODE,    context->ptrCommonConfig->counterMode);

    /* Generating the common configuration for the number of epilogue cycles */
    CY_REG32_CLR_SET(ptrBaseCfg->scanCtl2, MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY, ((0u < ptrIntrCxt->numEpiKrefDelay) ? ptrIntrCxt->numEpiKrefDelay : 1uL));
    CY_REG32_CLR_SET(ptrBaseCfg->scanCtl2, MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_PRS, ((0u < ptrIntrCxt->numEpiKrefDelayPrs) ? ptrIntrCxt->numEpiKrefDelayPrs : 1uL));
    /* Generating the common configuration for the system level chopping */
    CY_REG32_CLR_SET(ptrBaseCfg->scanCtl2, MSCLP_SCAN_CTL2_CHOP_POL, context->ptrCommonConfig->chopPolarity);

