zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
    /* Generating the common configuration for the coarse initialization and coarse short phase */
    CY_REG32_CLR_SET(ptrBaseCfg->initCtl1, MSCLP_INIT_CTL1_NUM_INIT_CMOD_12_RAIL_CYCLES,  ptrIntrCxt->numCoarseInitChargeCycles);
    CY_REG32_CLR_SET(ptrBaseCfg->initCtl1, MSCLP_INIT_CTL1_NUM_INIT_CMOD_12_SHORT_CYCLES, ptrIntrCxt->numCoarseInitSettleCycles);

    CY_REG32_CLR_SET(ptrBaseCfg->initCtl3, MSCLP_INIT_CTL3_CMOD_SEL, CY_CAPSENSE_CMOD12_PAIR_SELECTION);
    CY_REG32_CLR_SET(ptrBaseCfg->initCtl3, MSCLP_INIT_CTL3_NUM_PRO_OFFSET_CYCLES, ptrIntrCxt->numProOffsetCycles);

    /* Generating the common configuration for the number of sub-conversions to be run during PRO_DUMMY and PRO_WAIT phases. */
    CY_REG32_CLR_SET(ptrBaseCfg->initCtl4, MSCLP_INIT_CTL4_NUM_PRO_DUMMY_SUB_CONVS, context->ptrInternalContext->numFineInitCycles);
    CY_REG32_CLR_SET(ptrBaseCfg->initCtl4, MSCLP_INIT_CTL4_NUM_PRO_WAIT_KREF_DELAY, context->ptrInternalContext->numProWaitKrefDelay);
    CY_REG32_CLR_SET(ptrBaseCfg->initCtl4, MSCLP_INIT_CTL4_NUM_PRO_WAIT_KREF_DELAY_PRS,  context->ptrInternalContext->numProWaitKrefDelayPrs);

    /* Generating the common configuration for the clock dithering */
    ptrBaseCfg->sensePeriodCtl = _VAL2FLD(MSCLP_SENSE_PERIOD_CTL_LFSR_POLY,  context->ptrInternalContext->lfsrPoly) |
                                 _VAL2FLD(MSCLP_SENSE_PERIOD_CTL_LFSR_SCALE, context->ptrInternalContext->lfsrScale);

    /* Generating the common configuration for the CIC2 Filter */
    ptrBaseCfg->filterCtl = _VAL2FLD(MSCLP_FILTER_CTL_FILTER_MODE, CY_CAPSENSE_CIC2_FILTER_EN);

    /* Generating the common configuration for the dithering CapDAC */
    ptrBaseCfg->ditherCdacCtl = _VAL2FLD(MSCLP_DITHER_CDAC_CTL_SEL_FL,       context->ptrInternalContext->cdacDitherSeed) |
                                _VAL2FLD(MSCLP_DITHER_CDAC_CTL_LFSR_POLY_FL, context->ptrInternalContext->cdacDitherPoly);

    /* Generating the common configuration for the Compensation CDAC */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) || \
        (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE) || \
        (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_COMP_USAGE))
        CY_REG32_CLR_SET(ptrBaseCfg->ccompCdacCtl, MSCLP_CCOMP_CDAC_CTL_SEL_CO_PRO_OFFSET, ptrIntrCxt->proOffsetCdacComp);
    #else
        ptrBaseCfg->swSelCdacCo = 0u;
    #endif

    #if (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_25_MHZ)
        ptrBaseCfg->imoCtl = _VAL2FLD(MSCLP_IMO_CTL_FREQ, CY_MSCLP_IMO_25_MHZ);
    #elif (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_38_MHZ)
        ptrBaseCfg->imoCtl = _VAL2FLD(MSCLP_IMO_CTL_FREQ, CY_MSCLP_IMO_38_MHZ);
    #else /* (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_46_MHZ) */
        ptrBaseCfg->imoCtl = _VAL2FLD(MSCLP_IMO_CTL_FREQ, CY_MSCLP_IMO_46_MHZ);
    #endif
    ptrBaseCfg->imoCtl |= _VAL2FLD(MSCLP_IMO_CTL_CLOCK_MSC_DIV, (uint32_t)context->ptrInternalContext->modClk - 1u);

    capStatus = Cy_CapSense_GenerateModeConfig(context);

    /* PINS FUNCTIONS CONFIGURATION */
    capStatus |= Cy_CapSense_GeneratePinFunctionConfig(context);

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GeneratePinFunctionConfig
****************************************************************************//**
*
* Configures pin function-related registers in base configuration per defined
* CapSense configuration.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GeneratePinFunctionConfig(
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;

    uint32_t i;
    uint8_t idCounter = 0u;

    uint8_t * ptrMapping = &context->ptrInternalContext->mapPinState[0u];
    uint32_t * ptrCswFunc = &context->ptrBaseFrameContext->swSelCswFunc[0u];
    const uint32_t pinStates[CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER] = CY_CAPSENSE_PIN_STATES_ARR;

    for (i = 0u; i < CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER; i++)
    {
        ptrMapping[i] = CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED;
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_RX] = idCounter;
        idCounter++;
        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_TX] = idCounter;
        idCounter++;

        /* Set CSX inactive sensor connection */
        switch (context->ptrInternalContext->intrCsxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                idCounter++;
                break;
            case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
                ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2] = idCounter;
                idCounter++;
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                    if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z])
                    {
                        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                        idCounter++;
                    }
                #endif

                break;
            default:
                ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND] = idCounter;
                idCounter++;
                break;
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
            ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_NEG_TX] = idCounter;
            idCounter++;
        #endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED */
    #endif /* CY_CAPSENSE_CSX_EN */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS] = idCounter;
        idCounter++;

        /* Set CSD inactive sensor connection if it is not assigned already */
        switch (context->ptrInternalContext->intrCsdInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                    idCounter++;
                }
                break;
            case CY_CAPSENSE_SNS_CONNECTION_GROUND:
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND] = idCounter;
                    idCounter++;
                }
                break;
            default:
                /* No action */
                break;
        }

