zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_PASSIVE_EN)
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED ==
                        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD] = idCounter;
                    idCounter++;
                }
            #else
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED ==
                        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD] = idCounter;
                    idCounter++;
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_PASSIVE_EN) */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                    idCounter++;
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
            ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSP] = idCounter;
            idCounter++;
            ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSN] = idCounter;
            idCounter++;

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN)
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSZ] = idCounter;
                    idCounter++;
            #endif
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) */
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ISX_RX] = idCounter;
        idCounter++;
        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ISX_LX] = idCounter;
        idCounter++;

        /* Set ISX inactive sensor connection if it is not assigned already */
        switch (context->ptrInternalContext->intrIsxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                    idCounter++;
                }
                break;
            case CY_CAPSENSE_SNS_CONNECTION_GROUND:
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND] = idCounter;
                    idCounter++;
                }
                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) | \
                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) | \
                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN))
                    if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z])
                    {
                        ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                        idCounter++;
                    }
                #endif
                break;
            default:
                /* No action */
                break;
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        ptrMapping[CY_CAPSENSE_PIN_STATE_WBX_NODE_A] = idCounter;
        idCounter++;
        ptrMapping[CY_CAPSENSE_PIN_STATE_WBX_NODE_B] = idCounter;
        idCounter++;

        /* Set WBX inactive sensor connection if it is not assigned already */
        switch (context->ptrInternalContext->intrWbxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z] = idCounter;
                    idCounter++;
                }
                break;
            case CY_CAPSENSE_SNS_CONNECTION_GROUND:
                if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED == ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND])
                {
                    ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND] = idCounter;
                    idCounter++;
                }
                break;
            default:
                /* No action */
                break;
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

    context->ptrInternalContext->numFunc = idCounter;

    if (MSCLP_CSW_GLOBAL_FUNC_NR < idCounter)
    {
        capStatus = CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
    }
    else
    {
        for (i = 0u; i < CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER; i++)
        {
            if (CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED != ptrMapping[i])
            {
                ptrCswFunc[ptrMapping[i]] = pinStates[i];
            }
        }
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateSensorConfig
****************************************************************************//**
*
* Generates configuration to configure registers to
* the scan of the single sensor in the specified slot of the specified Sensor Frame.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param scanSlot
* The specified slot index.
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateSensorConfig(
                uint32_t snsFrameType,
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        const cy_stc_capsense_internal_context_t * ptrInternalCxt = context->ptrInternalContext;
        const cy_stc_capsense_scan_slot_t * ptrScanSlot = (CY_CAPSENSE_SNS_FRAME_ACTIVE == snsFrameType) ? &context->ptrScanSlots[scanSlot] :
                                                                                                           &context->ptrLpScanSlots[scanSlot];
    #else
        const cy_stc_capsense_scan_slot_t * ptrScanSlot = &context->ptrScanSlots[scanSlot];
        (void)snsFrameType;
    #endif /* CY_CAPSENSE_LP_EN */
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[ptrScanSlot->wdId];
    cy_stc_capsense_widget_context_t const * ptrWdCxt = &context->ptrWdContext[ptrScanSlot->wdId];
    uint32_t snsMethod = ptrWdCfg->senseMethod;
    uint8_t * ptrMapping = &context->ptrInternalContext->mapSenseMethod[0u];
    uint32_t modeSel = 0u;
    uint32_t tempValue;
    uint32_t *ptrSensorCfgLocal = ptrSensorCfg;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if (CY_CAPSENSE_SNS_FRAME_LOW_POWER == snsFrameType) /* If Low Power Sensor Frame */
        {
            ptrSensorCfgLocal[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL0] = _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL0_RC_COEFF, ptrInternalCxt->iirCoeffLp) |
                                                                _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL0_BL_COEFF_SLOW, ptrInternalCxt->bslnCoefSlow) |
                                                                _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL0_BL_COEFF_FAST, ptrInternalCxt->bslnCoefFast) |
                                                                _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL0_LOW_BL_RESET, ptrWdCxt->lowBslnRst) |
                                                                _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL0_BL_UPDATE_DELAY, ptrInternalCxt->bslnUpdateDelay);
            ptrSensorCfgLocal[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL1] = _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL1_NOISE_THR, ptrWdCxt->noiseTh) |
                                                                _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL1_NOISE_THR_NEG, ptrWdCxt->nNoiseTh);
            ptrSensorCfgLocal[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL2] = _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL2_SIGNAL_THR, ptrWdCxt->fingerTh) |
                                                                _VAL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL2_DEBOUNCE_THRESHOLD, ptrWdCxt->onDebounce) |
                                                                _BOOL2FLD(MSCLP_SNS_SNS_LP_AOS_SNS_CTL2_SIGNAL_TYPE, (CY_CAPSENSE_CSD_GROUP != snsMethod));
            ptrSensorCfgLocal[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL3] = 0u;
            ptrSensorCfgLocal[CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL4] = 0u;

            ptrSensorCfgLocal += (CY_MSCLP_11_SNS_REGS - CY_MSCLP_6_SNS_REGS);
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
        if (CY_CAPSENSE_SNS_FRAME_LOW_POWER != snsFrameType)
        {
            /* Set raw count filter coefficient */
            ptrSensorCfgLocal[CY_CAPSENSE_SNS_HW_IIR_INDEX] = (uint32_t)((uint32_t)ptrWdCfg->iirCoeffHw << CY_CAPSENSE_RC_HW_IIR_FILTER_COEFF_POS);
        }
    #endif

