zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
    ptrSensorCfgLocal[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] = _VAL2FLD(MSCLP_SNS_SNS_SCAN_CTL_NUM_CONV, (uint32_t)ptrWdCfg->numChopCycles - 1uL) | /* System level chopping */
                                                        _VAL2FLD(MSCLP_SNS_SNS_SCAN_CTL_NUM_SUB_CONVS, (uint32_t)ptrWdCxt->numSubConversions - 1uL); /* Number of sub-conversions */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        tempValue = ptrWdCxt->cicShift;
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN) ||\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN))
            if ((((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) ||
                 ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType)) &&
                  (ptrWdCfg->numCols <= ptrScanSlot->snsId) &&
                  (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod))
            {
                tempValue = ptrWdCxt->rowCicShift;
            }
        #endif
        ptrSensorCfgLocal[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= (uint32_t)(tempValue & (uint32_t)~(uint32_t)CY_CAPSENSE_CIC_AUTO_MASK) << CY_CAPSENSE_CIC_FIELD_POSITION;
    #endif

    if ((CY_CAPSENSE_ENABLE == ptrWdCxt->coarseInitBypassEn) &&
      (scanSlot != ptrWdCfg->firstSlotId))
    {
        ptrSensorCfgLocal[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= MSCLP_SNS_SNS_SCAN_CTL_INIT_BYPASS_Msk;
    }

    /* CapDAC configuration, after the SNS_SCAN_CTL initialization */
    capStatus = Cy_CapSense_GenerateCdacConfig(ptrScanSlot, ptrSensorCfgLocal, context);

    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        tempValue = ptrWdCxt->snsClk;
        switch (snsMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                case CY_CAPSENSE_CSD_GROUP:
                    modeSel = ptrMapping[CY_CAPSENSE_REG_MODE_CSD];
                    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN) || \
                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN))
                        if ((((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) ||
                             ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType)) &&
                              (ptrWdCfg->numCols <= ptrScanSlot->snsId))
                        {
                            tempValue = ptrWdCxt->rowSnsClk;
                        }
                    #endif
                    break;
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                case CY_CAPSENSE_CSX_GROUP:
                    modeSel = ptrMapping[CY_CAPSENSE_REG_MODE_CSX];
                    break;
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                case CY_CAPSENSE_ISX_GROUP:
                    modeSel = ptrMapping[CY_CAPSENSE_REG_MODE_ISX];
                    break;
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                case CY_CAPSENSE_WBX_GROUP:
                    modeSel = ptrMapping[CY_CAPSENSE_REG_MODE_WBX];
                    break;
            #endif

            default:
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }

        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            tempValue = Cy_CapSense_AdjustSnsClkDivider((uint8_t)snsMethod, ptrWdCxt->snsClkSource, (uint16_t)tempValue) - 1u;

            ptrSensorCfgLocal[CY_CAPSENSE_SNS_CTL_INDEX] = _VAL2FLD(MSCLP_SNS_SNS_CTL_SENSE_MODE_SEL, modeSel) |
                                                        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
                                                           _VAL2FLD(MSCLP_SNS_SNS_CTL_DECIM_RATE, (uint32_t)ptrWdCxt->cicRate - 1u) |
                                                        #endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN) */
                                                                    MSCLP_SNS_SNS_CTL_VALID_Msk |
                                                                    MSCLP_SNS_SNS_CTL_START_SCAN_Msk |
                                                            _VAL2FLD(MSCLP_SNS_SNS_CTL_SENSE_DIV, tempValue) |
                                                            _VAL2FLD(MSCLP_SNS_SNS_CTL_LFSR_MODE, ptrWdCxt->snsClkSource) |
                                                            _VAL2FLD(MSCLP_SNS_SNS_CTL_LFSR_BITS, ptrWdCxt->lfsrBits);
        }
    }

    return capStatus;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_ENABLED)
/*******************************************************************************
* Function Name: Cy_CapSense_GenerateMultiphaseSensorConfig
********************************************************************************
*
* Generates configuration for the multi-phase sensor groups.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param scanSlotIndex
* Sensor frame slot number.
*
* \param ptrSensorCfgLoc
* Specifies the pointer to the mask registers.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_GenerateMultiphaseSensorConfig(
                uint32_t snsFrameType,
                uint32_t scanSlotIndex,
                uint32_t * ptrSensorCfgLoc,
                cy_stc_capsense_context_t * context)
{
    uint8_t * ptrMapping = &context->ptrInternalContext->mapPinState[0u];
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;

    uint32_t snsFuncState;
    cy_stc_capsense_electrode_config_t const * eltdPinCfg;

    uint32_t wdIndex;
    uint32_t snsMethod;
    uint32_t snsIndex;

    uint32_t i = 0u;
    uint32_t j = 0u;
    uint32_t pattern = 0u;
    uint32_t order;

    uint32_t snsMask = 0u;
    uint32_t snsMaskNegative;
    uint32_t snsFuncStateNegative;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN))
        uint32_t zeroPattern = 0u;
        uint32_t snsMaskZero = 0u;
        uint32_t snsFuncStateZero;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        ptrScanSlots = (snsFrameType == CY_CAPSENSE_SNS_FRAME_ACTIVE) ? (context->ptrScanSlots) : (context->ptrLpScanSlots);
    #else
        ptrScanSlots = context->ptrScanSlots;
        (void)snsFrameType;
    #endif

    snsIndex = ptrScanSlots[scanSlotIndex].snsId;
    wdIndex = ptrScanSlots[scanSlotIndex].wdId;
    ptrWdCfg = &context->ptrWdConfig[wdIndex];
    snsMethod = ptrWdCfg->senseMethod;

    /* Prepare masks and pin states */
    snsMask = 0u;
    snsMaskNegative = 0u;

