zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
    snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_TX];
    snsFuncStateNegative = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_NEG_TX];

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
        {
            snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSP];
            snsFuncStateNegative = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSN];

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN)
                snsFuncStateZero = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSZ];
            #endif
        }
    #endif

    order = ptrWdCfg->mpOrder;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
        if (CY_CAPSENSE_CSX_GROUP == snsMethod)
        {
            /* Finds the first sensor number in mptx group */
            i = snsIndex - (snsIndex % order);
            /* Finds TX electrode of the first group sensor */
            i = ptrWdCfg->numCols + (i % ptrWdCfg->numRows);
        }
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
        {
            if (snsIndex < ptrWdCfg->numCols)
            {
                /* Finds the first sensor number in mpsc group */
                i = snsIndex - (snsIndex % order);
            }
            else
            {
                order = ptrWdCfg->mpOrderRows;
                /* Finds the first sensor number in mpsc group */
                i = snsIndex - ((snsIndex - ptrWdCfg->numCols) % order);
            }
        }
    #endif

    /* Finds the first electrode of the sensor */
    eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

    /* Finding the right vector / pattern for mpsc operation */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
        if (CY_CAPSENSE_CSX_GROUP == snsMethod)
        {
            pattern = ptrWdCfg->ptrMpTable->vector;
            i = (snsIndex % ptrWdCfg->mpOrder);
        }
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
        {
            pattern = (snsIndex < ptrWdCfg->numCols) ? ptrWdCfg->ptrMpTable->vector : (ptrWdCfg->ptrMpTable + 1u)->vector;

            if (snsIndex < ptrWdCfg->numCols)
            {
                i = (snsIndex % order);  /* bit position in vector */
            }
            else
            {
                i = ((snsIndex - ptrWdCfg->numCols) % order);
            }

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN)
                /* Set initial position of the zero electrode position */
                zeroPattern = (0uL != (order % 2u)) ? 1u : 0u;
            #endif
        }
    #endif

    if (0u != i)
    {
        pattern = (pattern >> i) | (pattern << (order - i));  /* rotate (adjust) the vector for the proper electrode position */

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN))
            if (0uL != (order % 2u))
            {
                zeroPattern = (1uL << order) >> i;  /* recalculate zero electrode position */
            }
        #endif
    }

    if (CY_CAPSENSE_MULTIPHASE_MAX_ORDER > order)
    {
        pattern &= (0x01uL << order) - 1u;  /* cut the pattern to the vector/order size */
    }

    /* Loop through all involved MPSC electrodes */
    for (j = 0u; j < order; j++)
    {
        if (0u != (pattern & 0x01u))  /* Positive electrode */
        {
            /* Loop through all pads for this electrode (ganged sensor) */
            for (i = 0u; i < eltdPinCfg->numPins; i++)
            {
                snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
            }
        }
        else  /* Negative electrode */
        {
            /* Loop through all pads for this electrode (ganged sensor) */
            for (i = 0u; i < eltdPinCfg->numPins; i++)
            {
                snsMaskNegative |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
            }
        }

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN))
            if (CY_CAPSENSE_CSD_GROUP == snsMethod)
            {
                if (0u != (zeroPattern & 0x01u))
                {
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                    {
                        snsMaskZero |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                    }
                }
            }
        #endif

        pattern >>= 0x01u;
        eltdPinCfg++;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN))
            if (CY_CAPSENSE_CSD_GROUP == snsMethod)
            {
                if (0uL != (order % 2u))
                {
                    zeroPattern >>= 0x01u;
                }
            }
        #endif
    }
    Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
    Cy_CapSense_CalculateMaskRegisters(snsMaskNegative, snsFuncStateNegative, ptrSensorCfgLoc);

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_ZERO_PIN_EN))
        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
        {
            if (0uL != (order % 2u))
            {
                Cy_CapSense_CalculateMaskRegisters(snsMaskZero, snsFuncStateZero, ptrSensorCfgLoc);
            }
        }
    #endif
}
#endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_ENABLED */


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateAllSensorConfig
********************************************************************************
*
* Generates configuration to configure registers to start
* a scan for all sensors of the specified Sensor Frame.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_GenerateAllSensorConfig(
                uint32_t snsFrameType,
                cy_stc_capsense_context_t * context)
{
    uint32_t scanSlotIndex;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;
    uint32_t * ptrSensorCfgLoc;
    uint32_t sensorSlotNum;
    uint8_t * ptrMapping = &context->ptrInternalContext->mapPinState[0u];
    uint32_t snsMethod;
    uint32_t snsMaskInactive = 0u;
    uint32_t snsFuncState = 0u;
    uint32_t wdIndex;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        uint32_t snsFuncStateSelfCap;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        uint32_t snsFuncStateMutualCap;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)  
        uint32_t snsFuncStateInductive;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)  
        uint32_t snsFuncStateWheatstoneBridge;
    #endif

