zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
    uint32_t i = 0u;
    uint32_t snsMask = 0u;
    uint32_t snsIndex;
    cy_stc_capsense_electrode_config_t const * eltdPinCfg;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        ptrScanSlots = (snsFrameType == CY_CAPSENSE_SNS_FRAME_ACTIVE) ? (context->ptrScanSlots) : (context->ptrLpScanSlots);
    #else
        ptrScanSlots = context->ptrScanSlots;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        uint32_t numEltd;
        uint32_t eltdIndex;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        uint32_t snsMaskInactiveIsx = 0u;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        uint32_t snsMaskInactiveWbx = 0u;
    #endif

    /* Create mask for all project electrodes */
    for (i = 0u; i < context->ptrCommonConfig->numPin; i++)
    {
        snsMask |= (0x01uL << ptrPinCfg->padNumber);
        ptrPinCfg++;
    }

    /* Add to mask all shield electrodes (if present) */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        ptrPinCfg = context->ptrShieldPinConfig;
        for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
        {
            snsMask |= (0x01uL << ptrPinCfg->padNumber);
            ptrPinCfg++;
        }
    #endif /*  (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */

    snsMaskInactive = snsMask;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        /* Create separate inactive mask of ISX pins only */
        for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
        {
            ptrWdCfg = &context->ptrWdConfig[wdIndex];
            snsMethod = ptrWdCfg->senseMethod;

            if (CY_CAPSENSE_ISX_GROUP == snsMethod)
            {
                numEltd = (uint32_t)ptrWdCfg->numRows + ptrWdCfg->numCols;
                eltdPinCfg = ptrWdCfg->ptrEltdConfig;

                for (eltdIndex = 0u; eltdIndex < numEltd; eltdIndex++)
                {
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                    {
                        snsMaskInactiveIsx |= (0x01uL << eltdPinCfg->ptrPin[i].padNumber);
                    }
                    eltdPinCfg++;
                }
            }
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        /* Create separate inactive mask of WBX pins only */
        for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
        {
            ptrWdCfg = &context->ptrWdConfig[wdIndex];
            snsMethod = ptrWdCfg->senseMethod;

            if (CY_CAPSENSE_WBX_GROUP == snsMethod)
            {
                numEltd = (uint32_t)ptrWdCfg->numRows + ptrWdCfg->numCols;
                eltdPinCfg = ptrWdCfg->ptrEltdConfig;

                for (eltdIndex = 0u; eltdIndex < numEltd; eltdIndex++)
                {
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                    {
                        snsMaskInactiveWbx |= (0x01uL << eltdPinCfg->ptrPin[i].padNumber);
                    }
                    eltdPinCfg++;
                }
            }
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        /* Define inactive pin state for CSX scans */
        switch (context->ptrInternalContext->intrCsxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateMutualCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z];
                break;
            case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
                snsFuncStateMutualCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2];
                break;
            default:
                snsFuncStateMutualCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND];
                break;
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        /* Define inactive pin state for ISX scans */
        switch (context->ptrInternalContext->intrIsxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_GROUND:
                snsFuncStateInductive = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND];
                break;
            default:
                snsFuncStateInductive = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z];
                break;
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        /* Define inactive pin state for CSD scans */
        switch (context->ptrInternalContext->intrCsdInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateSelfCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z];
                break;
            case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_PASSIVE_EN)
                    snsFuncStateSelfCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD];
                #else
                    snsFuncStateSelfCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD];
                #endif
                break;
            default:
                snsFuncStateSelfCap = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND];
                break;
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        /* Define inactive pin state for WBX scans */
        switch (context->ptrInternalContext->intrWbxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateWheatstoneBridge = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z];
                break;
            default:
                snsFuncStateWheatstoneBridge = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_GND];
                break;
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if (CY_CAPSENSE_SNS_FRAME_LOW_POWER == snsFrameType)
        {
            sensorSlotNum = CY_CAPSENSE_SLOT_LP_COUNT;
            ptrSensorCfgLoc = context->ptrSensorFrameLpContext;
            ptrScanSlots = context->ptrLpScanSlots;
        }
        else
        {
            sensorSlotNum = CY_CAPSENSE_SLOT_COUNT;
            ptrSensorCfgLoc = context->ptrSensorFrameContext;
            ptrScanSlots = context->ptrScanSlots;
        }
    #else
        sensorSlotNum = CY_CAPSENSE_SLOT_COUNT;
        ptrSensorCfgLoc = context->ptrSensorFrameContext;
        ptrScanSlots = context->ptrScanSlots;
    #endif

    for (scanSlotIndex = 0u; scanSlotIndex < sensorSlotNum; scanSlotIndex++)
    {
        (void)Cy_CapSense_GenerateSensorConfig(snsFrameType, scanSlotIndex, ptrSensorCfgLoc, context);

        snsIndex = ptrScanSlots[scanSlotIndex].snsId;
        wdIndex = ptrScanSlots[scanSlotIndex].wdId;
        ptrWdCfg = &context->ptrWdConfig[wdIndex];
        snsMethod = ptrWdCfg->senseMethod;

        switch(snsMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                case CY_CAPSENSE_CSD_GROUP:
                    snsFuncState = snsFuncStateSelfCap;
                    break;
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                case CY_CAPSENSE_CSX_GROUP:
                    snsFuncState = snsFuncStateMutualCap;
                    break;
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                case CY_CAPSENSE_ISX_GROUP:
                    snsFuncState = snsFuncStateInductive;
                    break;
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                case CY_CAPSENSE_WBX_GROUP:
                    snsFuncState = snsFuncStateWheatstoneBridge;
                    break;
            #endif
                default:
                    /* Do nothing */
                    break;
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
            if (CY_CAPSENSE_SNS_FRAME_LOW_POWER == snsFrameType)
            {
                ptrSensorCfgLoc += (CY_MSCLP_11_SNS_REGS - CY_MSCLP_6_SNS_REGS);
            }
        #endif

        /* INACTIVE SENSORS */ 
        Cy_CapSense_CalculateMaskRegisters(snsMaskInactive, snsFuncState, ptrSensorCfgLoc);

