zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
            /* 
            * The previous call of Cy_CapSense_CalculateMaskRegisters() configures all pins to ISC. 
            * This call overwrites previous configuration for ISX electrodes.
            */
            if (CY_CAPSENSE_ISX_GROUP != snsMethod)
            {
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z];
                Cy_CapSense_CalculateMaskRegisters(snsMaskInactiveIsx, snsFuncState, ptrSensorCfgLoc);
            }
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
            /* 
            * The previous call of Cy_CapSense_CalculateMaskRegisters() configures all pins to ISC. 
            * This call overwrites previous configuration for Wheatstone bridge electrodes since they can support only GND and High-Z state
            */
            if (((uint32_t)ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2] == snsFuncState) ||
                ((uint32_t)ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD] == snsFuncState) ||
                ((uint32_t)ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD] == snsFuncState))
            {
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z];
            }
            Cy_CapSense_CalculateMaskRegisters(snsMaskInactiveWbx, snsFuncState, ptrSensorCfgLoc);
        #endif

        /* SHIELD ELECTRODE */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
            if (0u < context->ptrCommonConfig->csdShieldNumPin)
            {
                snsMask = 0u;

                if (CY_CAPSENSE_CSD_GROUP == snsMethod)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_PASSIVE_EN)
                        snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD];
                    #else
                        snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD];
                    #endif
                }

                for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
                {
                    snsMask |= 0x01uL << context->ptrShieldPinConfig[i].padNumber;
                }
                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
            }
        #endif

        /* ACTIVE SELF-CAP SENSOR */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            if (CY_CAPSENSE_CSD_GROUP == snsMethod)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                    if (((CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrder) && (snsIndex < ptrWdCfg->numCols)) ||      /* for cols */
                        ((CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrderRows) && (snsIndex >= ptrWdCfg->numCols)))   /* for rows */
                    {
                        Cy_CapSense_GenerateMultiphaseSensorConfig(snsFrameType, scanSlotIndex, ptrSensorCfgLoc, context);
                    }
                    else
                    {
                        snsMask = 0u;
                        snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS];
                        eltdPinCfg = &ptrWdCfg->ptrEltdConfig[snsIndex];
                        /* Loop through all pads for this electrode (ganged sensor) */
                        for (i = 0u; i < eltdPinCfg->numPins; i++)
                        {
                            snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                        }
                        Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
                    }
                #else
                    snsMask = 0u;
                    snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS];
                    eltdPinCfg = &ptrWdCfg->ptrEltdConfig[snsIndex];
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                    {
                        snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                    }
                    Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
                #endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED */
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

        /* ACTIVE MUTUAL-CAP SENSOR */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            if (CY_CAPSENSE_CSX_GROUP == snsMethod)
            {
                /* RX ELECTRODE */
                snsMask = 0u;
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_RX];
                i = snsIndex / ptrWdCfg->numRows;
                eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                /* Loop through all pads for this electrode (ganged sensor) */
                for (i = 0u; i < eltdPinCfg->numPins; i++)
                {
                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                }
                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);

                /* Handles multi-phase TX feature */
                #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
                    if (ptrWdCfg->mpOrder >= CY_CAPSENSE_MPTX_MIN_ORDER)
                    {
                        Cy_CapSense_GenerateMultiphaseSensorConfig(snsFrameType, scanSlotIndex, ptrSensorCfgLoc, context);
                    }
                    else
                    {
                        /* TX ELECTRODE */
                        snsMask = 0u;
                        snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_TX];
                        i = ptrWdCfg->numCols +
                                (snsIndex % ptrWdCfg->numRows);
                        eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                        /* Loop through all pads for this electrode (ganged sensor) */
                        for (i = 0u; i < eltdPinCfg->numPins; i++)
                        {
                            snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                        }
                        Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
                    }
                #else
                    /* TX ELECTRODE */
                    snsMask = 0u;
                    snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_CSX_TX];
                    i = ptrWdCfg->numCols + (snsIndex % ptrWdCfg->numRows);
                    eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                    {
                        snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                    }
                    Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
                #endif
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

        /* ACTIVATE INDUCTIVE SENSOR */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
            if (CY_CAPSENSE_ISX_GROUP == snsMethod)
            {
                /* RX ELECTRODE */
                snsMask = 0u;
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ISX_RX];
                i = snsIndex;
                eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                /* Loop through all pads for this electrode (ganged sensor) */
                for (i = 0u; i < eltdPinCfg->numPins; i++)
                {
                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                }
                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);

                /* LX ELECTRODE */
                snsMask = 0u;
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_IDX_ISX_LX];
                i = snsIndex + ptrWdCfg->numRows;
                eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                /* Loop through all pads for this electrode (ganged sensor) */
                for (i = 0u; i < eltdPinCfg->numPins; i++)
                {
                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                }
                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

