zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
        /* ACTIVATE WHEATSTONE BRIDGE SENSOR */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
            if (CY_CAPSENSE_WBX_GROUP == snsMethod)
            {
                /* NODE A ELECTRODE */
                snsMask = 0u;
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_WBX_NODE_A];
                i = snsIndex;
                eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                /* Loop through all pads for this electrode (ganged sensor) */
                for (i = 0u; i < eltdPinCfg->numPins; i++)
                {
                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                }
                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);

                /* NODE B ELECTRODE */
                snsMask = 0u;
                snsFuncState = ptrMapping[CY_CAPSENSE_PIN_STATE_WBX_NODE_B];
                i = snsIndex + ptrWdCfg->numRows;
                eltdPinCfg = &ptrWdCfg->ptrEltdConfig[i];

                /* Loop through all pads for this electrode (ganged sensor) */
                for (i = 0u; i < eltdPinCfg->numPins; i++)
                {
                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                }
                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, ptrSensorCfgLoc);
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

        ptrSensorCfgLoc +=  CY_MSCLP_6_SNS_REGS;
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
            if (CY_CAPSENSE_SNS_FRAME_LOW_POWER != snsFrameType)
            {
                ptrSensorCfgLoc++;
            }
        #endif
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalculateMaskRegisters
****************************************************************************//**
*
* Calculates the mask for pins that have to be updated for Control MUX
* connection.
*
* \param mask
* Specifies the mask of pins that should be updated.
*
* \param funcState
* Specifies the pin state functionality.
*
* \param ptrCfg
* Specifies the pointer to the mask registers.
*
*******************************************************************************/
void Cy_CapSense_CalculateMaskRegisters(
                uint32_t mask,
                uint32_t funcState,
                uint32_t * ptrCfg)
{
    uint32_t * ptrCfgMask = ptrCfg;

    ptrCfgMask[0u] &= ~mask;
    ptrCfgMask[1u] &= ~mask;
    ptrCfgMask[2u] &= ~mask;
    if (0u != (funcState & 0x04u))
    {
        ptrCfgMask[0u] |= mask;
    }
    if (0u != (funcState & 0x02u))
    {
        ptrCfgMask[1u] |= mask;
    }
    if (0u != (funcState & 0x01u))
    {
        ptrCfgMask[2u] |= mask;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateCdacConfig
****************************************************************************//**
*
* Generates the Cap DAC configuration for a selected sensor.
*
* \param ptrScanSlot
* The pointer to the slot structure \ref cy_stc_capsense_scan_slot_t.
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateCdacConfig(
                const cy_stc_capsense_scan_slot_t * ptrScanSlot,
                uint32_t * ptrSensorCfg,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t compDiv;
    uint32_t wdIndex = ptrScanSlot->wdId;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[wdIndex];
    uint32_t snsCdacCtlReg = MSCLP_SNS_SNS_CDAC_CTL_CLOCK_REF_RATE_Msk;
    uint8_t senseMethod = ptrWdCfg->senseMethod;
    cy_stc_capsense_internal_context_t * ptrIntCxt = context->ptrInternalContext;
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (CY_CAPSENSE_DISABLE == CY_CAPSENSE_SMARTSENSE_CSD_EN))
        uint32_t cdacTrim;
        uint32_t cdacCode;
    #endif
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && \
         (CY_CAPSENSE_DISABLE == CY_CAPSENSE_SMARTSENSE_CSD_EN) && \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN))
        uint32_t cdacFineCode;
        uint32_t cdacTotal;
    #endif

    /* Compensation CDAC Divider */
    compDiv = context->ptrWdContext[wdIndex].cdacCompDivider;
    compDiv = (compDiv > 0u) ? (compDiv - 1u) : 0u;
    ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= _VAL2FLD(MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV, compDiv);

    if (((CY_CAPSENSE_CSD_GROUP == senseMethod) && (CY_CAPSENSE_ENABLE == ptrIntCxt->csdCdacDitherEn)) ||
        ((CY_CAPSENSE_CSX_GROUP == senseMethod) && (CY_CAPSENSE_ENABLE == ptrIntCxt->csxCdacDitherEn)) ||
        ((CY_CAPSENSE_ISX_GROUP == senseMethod) && (CY_CAPSENSE_ENABLE == ptrIntCxt->isxCdacDitherEn)))
    {
        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_LFSR_SCALE_FL, ptrWdCfg->ptrWdContext->cdacDitherValue) |
                         _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_FL_MODE, 1uL); /* the same as it was for msc */
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN)
        /* Uses configuration from Configurator for LLW if tuning is complete */
        if ((((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == ptrWdCfg->wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == ptrWdCfg->wdType)) &&
            (0u != (ptrWdCfg->centroidConfig & CY_CAPSENSE_LLW_TUNING_COMPLETED_MASK)))
        {
            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCfg->ptrWdContext->cdacRef);
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN)
                snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, ptrWdCfg->ptrWdContext->cdacFine);
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_EN)
                snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO, ptrWdCfg->ptrSnsContext[ptrScanSlot->snsId].cdacComp);
            #endif
        }
        else
    #endif
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                if (CY_CAPSENSE_CSX_GROUP == senseMethod)
                {
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS))
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCfg->ptrWdContext->cdacRef);
                    }
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN)
                        if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
                        {
                            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, ptrWdCfg->ptrWdContext->cdacFine);
                        }
                    #endif
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_MASK) >> CY_CAPSENSE_CDAC_COMP_MODE_POS))
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO, ptrWdCfg->ptrSnsContext[ptrScanSlot->snsId].cdacComp);
                    }
                }
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                if (CY_CAPSENSE_ISX_GROUP == senseMethod)
                {
                    if ((CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS)) ||
                            (0u != (CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK & context->ptrCommonContext->status)))
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCfg->ptrWdContext->cdacRef);
                    }
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN)
                        if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
                        {
                            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, ptrWdCfg->ptrWdContext->cdacFine);
                        }
                    #endif
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_MASK) >> CY_CAPSENSE_CDAC_COMP_MODE_POS))
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO, ptrWdCfg->ptrSnsContext[ptrScanSlot->snsId].cdacComp);
                    }
                }
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                if (CY_CAPSENSE_WBX_GROUP == senseMethod)
                {
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS))
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCfg->ptrWdContext->cdacRef);
                    }
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN)
                        if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
                        {
                            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, ptrWdCfg->ptrWdContext->cdacFine);
                        }
                    #endif
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_MASK) >> CY_CAPSENSE_CDAC_COMP_MODE_POS))
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO, ptrWdCfg->ptrSnsContext[ptrScanSlot->snsId].cdacComp);
                    }
                }
            #endif
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_EN))
                if ((CY_CAPSENSE_CSD_GROUP == senseMethod) && (0u != (CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK & context->ptrCommonContext->status)))
                {
                    snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCfg->ptrWdContext->cdacRef);
                    if (ptrWdCfg->numCols <= ptrScanSlot->snsId)
                    {
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCfg->ptrWdContext->rowCdacRef);
                    }
                }
            #endif

