zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
            /* Adds CDAC scaling to CSD widget only in manual mode.
             * If MPN is not trimmed scaling is omitted however manual CDAC codes
             * are still stored.
             */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (CY_CAPSENSE_DISABLE == CY_CAPSENSE_SMARTSENSE_CSD_EN))
                if (CY_CAPSENSE_CSD_GROUP == senseMethod)
                {
                    #if (0u == CY_CAPSENSE_CDAC_TRIM_EN)
                        cdacTrim = 0u;
                    #else
                        cdacTrim = context->ptrCommonContext->cdacTrimCoefficient;
                    #endif
                    if (0u == cdacTrim)
                    {
                        /* Performs no corrections if parts are not trimmed */
                        cdacTrim = (uint32_t)(0x01uL << CY_CAPSENSE_CDAC_TRIM_OFFSET);
                    }
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN)
                        /* Ref+Fine CDAC manual mode only */
                        if ((CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS)) &&
                            (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS)))
                        {
                            cdacCode = ptrWdCfg->ptrWdContext->cdacRef;
                            cdacFineCode = ptrWdCfg->ptrWdContext->cdacFine;
                            if (ptrWdCfg->numCols <= ptrScanSlot->snsId)
                            {
                                cdacCode = ptrWdCfg->ptrWdContext->rowCdacRef;
                                cdacFineCode = ptrWdCfg->ptrWdContext->rowCdacFine;
                            }

                            cdacTotal = cdacCode * CY_CAPSENSE_REF_CDAC_LSB_X100;
                            cdacTotal += cdacFineCode * CY_CAPSENSE_CDAC_FINE_LSB_X100;

                            /* Max value for now is 234245.
                            * To avoid overflow reduce trim accuracy for two bits for total CDAC capacitance.
                            */
                            cdacTotal *= (cdacTrim >> 2u);
                            cdacTotal += (uint32_t)(0x01uL << (CY_CAPSENSE_CDAC_TRIM_OFFSET - 3u));
                            cdacTotal >>= (CY_CAPSENSE_CDAC_TRIM_OFFSET - 2u);
                            /* Max value for now is 234245.
                            * To avoid overflow reduce trim accuracy for one bit for Cref trim.
                            */
                            cdacCode *= (cdacTrim >> 1u);
                            cdacCode >>= (CY_CAPSENSE_CDAC_TRIM_OFFSET - 1u);

                            if (CY_CAPSENSE_CDAC_REF_MAX_VALUE < cdacCode)
                            {
                                cdacCode = CY_CAPSENSE_CDAC_REF_MAX_VALUE;
                            }

                            cdacFineCode = cdacTotal - (cdacCode * CY_CAPSENSE_REF_CDAC_LSB_X100);
                            cdacFineCode += (CY_CAPSENSE_CDAC_FINE_LSB_X100 >> 0x01u);
                            cdacFineCode /= CY_CAPSENSE_CDAC_FINE_LSB_X100;

                            while ((CY_CAPSENSE_CDAC_FINE_MAX_VALUE < cdacFineCode) && (CY_CAPSENSE_CDAC_REF_MAX_VALUE > cdacCode))
                            {
                                cdacCode++;
                                if (CY_CAPSENSE_CDAC_REF_MAX_VALUE < cdacCode)
                                {
                                    cdacCode = CY_CAPSENSE_CDAC_REF_MAX_VALUE;
                                }

                                if (cdacTotal < (cdacCode * CY_CAPSENSE_REF_CDAC_LSB_X100))
                                {
                                    cdacFineCode = 0u;
                                    break;
                                }

                                cdacFineCode = cdacTotal - (cdacCode * CY_CAPSENSE_REF_CDAC_LSB_X100);
                                cdacFineCode += (CY_CAPSENSE_CDAC_FINE_LSB_X100 >> 0x01u);
                                cdacFineCode /= CY_CAPSENSE_CDAC_FINE_LSB_X100;
                            }

                            if (CY_CAPSENSE_CDAC_FINE_MAX_VALUE < cdacFineCode)
                            {
                                cdacFineCode = CY_CAPSENSE_CDAC_FINE_MAX_VALUE;
                            }

                            if (0u == (cdacCode + cdacFineCode))
                            {
                                cdacFineCode = 1u;
                            }
                            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, cdacCode);
                            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, cdacFineCode);
                        }
                        /* Fine CDAC manual mode only */
                        else if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_FINE_MODE_MASK) >> CY_CAPSENSE_CDAC_FINE_MODE_POS))
                        {
                            cdacCode = ptrWdCfg->ptrWdContext->cdacFine;
                            if (ptrWdCfg->numCols <= ptrScanSlot->snsId)
                            {
                                cdacCode = ptrWdCfg->ptrWdContext->rowCdacFine;
                            }
                            cdacCode *= cdacTrim;
                            cdacCode += CY_CAPSENSE_CDAC_TRIM_ROUND;
                            cdacCode >>= CY_CAPSENSE_CDAC_TRIM_OFFSET;
                            if (CY_CAPSENSE_CDAC_FINE_MAX_VALUE < cdacCode)
                            {
                                cdacCode = CY_CAPSENSE_CDAC_FINE_MAX_VALUE;
                            }
                            if (CY_CAPSENSE_CDAC_FINE_MIN_VALUE > cdacCode)
                            {
                                cdacCode = CY_CAPSENSE_CDAC_FINE_MIN_VALUE;
                            }
                            snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, cdacCode);
                        }
                        else
                    #endif
                    /* Ref CDAC manual mode only */
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_REF_MODE_MASK) >> CY_CAPSENSE_CDAC_REF_MODE_POS))
                    {
                        cdacCode = ptrWdCfg->ptrWdContext->cdacRef;
                        if (ptrWdCfg->numCols <= ptrScanSlot->snsId)
                        {
                            cdacCode = ptrWdCfg->ptrWdContext->rowCdacRef;
                        }
                        cdacCode *= cdacTrim;
                        cdacCode += CY_CAPSENSE_CDAC_TRIM_ROUND;
                        cdacCode >>= CY_CAPSENSE_CDAC_TRIM_OFFSET;
                        if (CY_CAPSENSE_CDAC_REF_MAX_VALUE < cdacCode)
                        {
                            cdacCode = CY_CAPSENSE_CDAC_REF_MAX_VALUE;
                        }
                        if (CY_CAPSENSE_CDAC_REF_MIN_VALUE > cdacCode)
                        {
                            cdacCode = CY_CAPSENSE_CDAC_REF_MIN_VALUE;
                        }
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, cdacCode);
                    }
                    else
                    {
                        /* Nothing to do. No valid configuration */
                    }
                    if (CY_CAPSENSE_CDAC_MODE_MANUAL == ((ptrWdCfg->cdacConfig & CY_CAPSENSE_CDAC_COMP_MODE_MASK) >> CY_CAPSENSE_CDAC_COMP_MODE_POS))
                    {
                        cdacCode = ptrWdCfg->ptrSnsContext[ptrScanSlot->snsId].cdacComp;
                        cdacCode *= cdacTrim;
                        cdacCode += CY_CAPSENSE_CDAC_TRIM_ROUND;
                        cdacCode >>= CY_CAPSENSE_CDAC_TRIM_OFFSET;
                        if (CY_CAPSENSE_CDAC_COMP_MAX_VALUE < cdacCode)
                        {
                            cdacCode = CY_CAPSENSE_CDAC_COMP_MAX_VALUE;
                        }
                        snsCdacCtlReg |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO, cdacCode);
                    }
                }
            #endif
        }

    ptrSensorCfg[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] = snsCdacCtlReg;

