zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.c
    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateModeConfig
****************************************************************************//**
*
* Configures mode-related registers in base configuration per defined
* CapSense configuration.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateModeConfig(const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;

    uint32_t i;
    uint8_t idCounter = 0u;
    uint8_t * ptrMapping = &context->ptrInternalContext->mapSenseMethod[0u];
    const cy_stc_msclp_mode_config_t modeArr[CY_CAPSENSE_REG_MODE_NUMBER] = CY_CAPSENSE_SM_MODES_ARR;
    cy_stc_msclp_mode_config_t * mode = context->ptrBaseFrameContext->mode;

    /* Checks for overflow */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        idCounter++;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        idCounter++;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        idCounter++;
    #endif
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        idCounter++;
    #endif

    context->ptrInternalContext->numSenseMethod = idCounter;
    if (MSCLP_SNS_SENSE_MODE_NR < idCounter)
    {
        capStatus = CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
    }
    else
    {
        idCounter = 0u;
        /* Full fill look up table for mode registers */
        for (i = 0u; i < CY_CAPSENSE_REG_MODE_ARRAY_NUMBER; i++)
        {
            ptrMapping[i] = CY_CAPSENSE_REG_MODE_UNDEFINED;
        }
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_CSD];
            if (CY_CAPSENSE_ENABLE == context->ptrInternalContext->csdCdacDitherEn)
            {
                mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_CSD_DITHERING];
            }
            ptrMapping[CY_CAPSENSE_REG_MODE_CSD] = idCounter;
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN))
                idCounter++;
            #endif
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_CSX];
            if (CY_CAPSENSE_ENABLE == context->ptrInternalContext->csxCdacDitherEn)
            {
                mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_CSX_DITHERING];
            }
            if (CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == context->ptrInternalContext->intrCsxInactSnsConn)
            {
                /* Close the reference to filter switch */
                mode[idCounter].swSelSh |= MSCLP_MODE_SW_SEL_SH_SOMB_Msk;
            }
            ptrMapping[CY_CAPSENSE_REG_MODE_CSX] = idCounter;
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN))
                idCounter++;
            #endif
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
            mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_ISX];
            if (CY_CAPSENSE_ENABLE == context->ptrInternalContext->isxCdacDitherEn)
            {
                mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_ISX_DITHERING];
            }
            ptrMapping[CY_CAPSENSE_REG_MODE_ISX] = idCounter;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                idCounter++;
            #endif  
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
            mode[idCounter] = modeArr[CY_CAPSENSE_REG_MODE_WBX];
            ptrMapping[CY_CAPSENSE_REG_MODE_WBX] = idCounter;
        #endif
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_AdjustSnsClkDivider
****************************************************************************//**
*
* If the PRS is selected as the Sense Clock source, adjusts the Sense Clock
* divider to obtain the max frequency of the PRS sequence equal to
* ModClkFreq / SenseClkDivider. Updates the sense Clock divider with the minimal
* supported value in case if it is out of range for the specified parameters.
*
* \param snsMethod
*  Specifies the widget group:
*   - CSD (CY_CAPSENSE_CSD_GROUP)
*   - CSX (CY_CAPSENSE_CSX_GROUP)
*   - ISX (CY_CAPSENSE_ISX_GROUP)
*
* \param snsClkSource
*  Specifies the sense Clock source, supported by MSCv3 HW:
*   - CY_CAPSENSE_CLK_SOURCE_DIRECT
*   - CY_CAPSENSE_CLK_SOURCE_SSC
*   - CY_CAPSENSE_CLK_SOURCE_PRS
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \return
*  Adjusted value of the Sense Clock divider.
*
*******************************************************************************/
uint32_t Cy_CapSense_AdjustSnsClkDivider(
                        uint8_t snsMethod,
                        uint8_t snsClkSource,
                        uint16_t snsClkDivider)
{
    uint32_t retVal = (uint32_t)snsClkDivider;

    if (CY_CAPSENSE_CLK_SOURCE_PRS == ((uint32_t)snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
    {
        if ((CY_CAPSENSE_CSD_GROUP == snsMethod) ||
            (CY_CAPSENSE_ISX_GROUP == snsMethod))
        {
            retVal >>= CY_CAPSENSE_4PH_PRS_SNS_CLOCK_DIVIDER_SHIFT;
        }
        else
        {
            retVal >>= CY_CAPSENSE_2PH_PRS_SNS_CLOCK_DIVIDER_SHIFT;
        }
    }

    return retVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ApplyWidgetCdacParam
****************************************************************************//**
*
* Applies a desired widget CDAC parameters.
*
* This function takes CDAC parameters from a CAPSENSE&trade; Data Structure
* and add them to all sensors of sensor frame structure.
*
* The following CDAC parameters are taken care by this function:
* * Widget reference CDAC (cdacRef)
* * Widget fine CDAC (cdacFine), if enabled
* * Widget compensation CDAC divider (cdacCompDivider)
* * Sensor compensation CDAC (cdacComp)
*
*******************************************************************************/
void Cy_CapSense_ApplyWidgetCdacParam(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;

    uint32_t * ptrSensorFrame = &context->ptrSensorFrameContext[ptrWdCfg->firstSlotId * CY_CAPSENSE_SENSOR_FRAME_SIZE];

    for (i = 0u; i < context->ptrWdConfig[widgetId].numSns; i++)
    {
        ptrSensorFrame[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] &= ~MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV_Msk;
        ptrSensorFrame[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= _VAL2FLD(MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV, ((uint32_t)ptrWdCxt->cdacCompDivider - 1u));

        ptrSensorFrame[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] &= ~(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE_Msk |
                                                            MSCLP_SNS_SNS_CDAC_CTL_SEL_CO_Msk |
                                                            MSCLP_SNS_SNS_CDAC_CTL_SEL_CF_Msk);
        ptrSensorFrame[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, ptrWdCxt->cdacRef);
        #if (CY_CAPSENSE_CDAC_FINE_EN)
            ptrSensorFrame[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CF, ptrWdCxt->cdacFine);
        #endif
        ptrSensorFrame[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] |= _VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_CO, ptrSnsCxt[i].cdacComp);

        ptrSensorFrame += CY_CAPSENSE_SENSOR_FRAME_SIZE;
    }
    context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);
}


#endif /* CY_IP_M0S8MSCV3LP */


/* [] END OF FILE */
